# Analytical Transfer Switch Data Class

Source: https://www.revitapidocs.com/2026/6029f894-5a16-522b-8759-57b4e3475952.htm

---

| Analytical Transfer Switch Data Class |
| --- |

Represents the data and parameters of electrical analytical transfer switch. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical AnalyticalDistributionNodePropertyData
Autodesk.Revit.DB.Electrical AnalyticalPowerDistributableNodeData
Autodesk.Revit.DB.Electrical AnalyticalTransferSwitchData

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class AnalyticalTransferSwitchData : AnalyticalPowerDistributableNodeData
```

```
Public Class AnalyticalTransferSwitchData
	Inherits AnalyticalPowerDistributableNodeData
```

```
public ref class AnalyticalTransferSwitchData : public AnalyticalPowerDistributableNodeData
```

```
type AnalyticalTransferSwitchData =
    class
        inherit AnalyticalPowerDistributableNodeData
    end
```
The AnalyticalTransferSwitchData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | AssignedPhasesNumber | The number of electrical phases assigned through the distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | AssignedVoltage | The voltage assigned through the distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | CurrentRating | The current rating value of the electrical analytical transfer switch. |
|  | DistributionSystem | The distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | TotalConnectedCurrent | The total connected current of the electrical analytical transfer switch. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetAllAvailableConnectedPhasesOnDownstream | Get all the available electrical connected phases that this power distributable node can provide to the downstream node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetApparentPerPhaseResults | Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetConnectedPhasesOnDownstream | Get the electrical connected phases of the downstream node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetDemandPerPhaseResults | Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | SetConnectedPhasesOnDownstream | Set the electrical connected phases of the downstream node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace